# DoubleParameterValue Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleParameterValue Class
Members See Also
---
A class that holds a Double value of a parameter element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public class DoubleParameterValue : ParameterValue
```

Visual Basic
---
```text
Public Class DoubleParameterValue _
	Inherits ParameterValue
```

Visual C++
---
```text
public ref class DoubleParameterValue : public ParameterValue
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterValue Autodesk.Revit.DB..::..DoubleParameterValue
# See Also
DoubleParameterValue Members
Autodesk.Revit.DB Namespace